Revit 2026 API

# DirectContext3DHandleSettings(DirectContext3DHandleSettings) Constructor

---

Constructs a copy of source object.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DirectContext3DHandleSettings(
	DirectContext3DHandleSettings other
)
```
```vb
Public Sub New (
	other As DirectContext3DHandleSettings
)
```
```cpp
public:
DirectContext3DHandleSettings(
	DirectContext3DHandleSettings^ other
)
```
```fsharp
new :
        other : DirectContext3DHandleSettings -> DirectContext3DHandleSettings
```

#### Parameters

other DirectContext3DHandleSettings
     Source object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DirectContext3DHandleSettings Class

DirectContext3DHandleSettings Overload

Autodesk.Revit.DB.DirectContext3D Namespace